{
  "id": 637856,
  "category": "phones",
  "year": 2018,
  "namespaceId": "apple-iphone-xr",
  "name": "Apple iPhone XR",
  "screen": "6,1' IPS",
  "resolution": "1792 x 828",
  "processor": "Apple A12 Bionic",
  "ram": "4GB",
  "camera": "12 Mp",
  "colors": [
    "black",
    "blue",
    "coral",
    "red",
    "white"
  ],
  "capacities": [
    "64GB",
    "128GB",
    "256GB"
  ],
  "models": [
    {
      "capacity": "64GB",
      "fullPrice": 380,
      "discountPrice": 342,
      "colorsAvailable": {
        "black": 45,
        "blue": 57,
        "coral": 19,
        "red": 20,
        "white": 29
      }
    },
    {
      "capacity": "128GB",
      "fullPrice": 456,
      "discountPrice": 410,
      "colorsAvailable": {
        "black": 0,
        "blue": 13,
        "coral": 74,
        "red": 0,
        "white": 0
      }
    },
    {
      "capacity": "256GB",
      "fullPrice": 547,
      "discountPrice": 492,
      "colorsAvailable": {
        "black": 0,
        "blue": 7,
        "coral": 26,
        "red": 74,
        "white": 39
      }
    }
  ],
  "description": [
    {
      "title": "За межами",
      "text": [
        "Чарівний новий спосіб взаємодії з iPhone. Революційні функції безпеки, призначені для порятунку життів. Інноваційна камера для неймовірної деталізації. Усе це працює на найкращому чіпі для смартфона.",
        "iPhone також розроблено з нуля, щоб захистити вашу конфіденційність і надати вам можливість контролювати те, чим ви ділитеся та з ким ділитеся"
      ]
    },
    {
      "title": "Камера",
      "text": [
        "Зустрічайте першу систему камери, яка поєднує передові технології з легендарною простотою iPhone. Знімайте до чотирьох разів більше кадрів. Отримуйте чудові зображення навіть за  різко слабким освітленням. Знімайте відео найвищої якості на смартфон, а потім редагуйте за допомогою тих самих інструментів, які вам подобаються для фотографій. Ви ніколи не зустрічали чогось  подібного.",
        "Спрямуйте свою камеру за допомогою фотографічних стилів. Виберіть вигляд — наприклад, «Теплий» або «Холодний» — і iPhone вибірково застосовує коригування, зберігаючи небо та відтінки шкіри природними. Тож ваші фотографії автоматично матимуть вигляд, який вам подобається."
      ]
    },
    {
      "title": "Тривалий час автономної роботи",
      "text": [
        "Високоефективний чіп, вдосконалена батарея та iOS 16 працюють разом, щоб подовжити час автономної роботи. Якщо вам знадобиться зарядити, просто покладіть iPhone на бездротовий зарядний пристрій. Або підключіть адаптер потужністю 20 Вт або вище, щоб швидко заряджати від нуля до 50 відсотків за 30 хвилин"
      ]
    },
    {
      "title": "Швидше завантаження. Швидше потокове передавання. Швидша гра. Менше відставання. Більше веселощів.",
      "text": [
        "Від прямої трансляції до ігор для кількох гравців і обміну відео – 5G дійсно прискорює роботу. Це навіть робить FaceTime у високій чіткості та SharePlay плавними та безперебійними, коли ви в дорозі.."
      ]
    }
  ]
}
