{
  "id": 318748,
  "category": "tablets",
  "year": 2020,
  "namespaceId": "apple-ipad-air-4",
  "name": "Apple iPad Air 4",
  "screen": "10,9' IPS",
  "resolution": "2360 x 1640",
  "processor": "Apple A14 Bionic",
  "ram": "4GB",
  "camera": "12 Mp",
  "colors": [
    "gold",
    "gray",
    "blue",
    "green",
    "silver"
  ],
  "capacities": [
    "64GB",
    "128GB",
    "256GB"
  ],
  "models": [
    {
      "capacity": "64GB",
      "fullPrice": 620,
      "discountPrice": 558,
      "colorsAvailable": {
        "gold": 86,
        "gray": 0,
        "blue": 72,
        "green": 16,
        "silver": 0
      }
    },
    {
      "capacity": "128GB",
      "fullPrice": 744,
      "discountPrice": 669,
      "colorsAvailable": {
        "gold": 20,
        "gray": 80,
        "blue": 49,
        "green": 0,
        "silver": 87
      }
    },
    {
      "capacity": "256GB",
      "fullPrice": 892,
      "discountPrice": 802,
      "colorsAvailable": {
        "gold": 83,
        "gray": 41,
        "blue": 0,
        "green": 16,
        "silver": 84
      }
    }
  ],
  "description": [
    {
      "title": "Навколо краса",
      "text": [
        "iPad дає змогу зануритися у все, що ви читаєте, дивитеся чи створюєте. Дисплей Liquid Retina оснащений передовими технологіями, як-от True Tone, широким кольором P3 і антибліковим покриттям.",
        "TouchID вбудовано в кнопку, тому ви можете використовувати відбиток пальця, щоб розблокувати iPad, увійти в програми та безпечно здійснювати платежі за допомогою Apple Pay. А iPad доступний у чудових кольорах."
      ]
    },
    {
      "title": "Розваги на швидкості",
      "text": [
        "Проривний чіп тепер в iPad. Він забезпечує до 60 відсотків більшу продуктивність, ніж попереднє покоління, що робить iPad потужним джерелом творчих і мобільних ігор. Плавно виконуйте багатозадачність між потужними програмами та грайте в ігри з інтенсивною графікою. Тож ви можете піти ще далі у своїй творчості за допомогою таких програм, як SketchUp."
      ]
    },
    {
      "title": "Камера",
      "text": [
        "12-мегапіксельна ультраширока передня камера забезпечує центральну сцену, роблячи відеодзвінки більш природними, а створення контенту — веселішим. У міру того, як ви рухаєтеся, камера автоматично панорамується, щоб утримувати вас у центрі кадру. Коли інші приєднуються до кадру або залишають його, зображення розширюється або збільшується. Тож ви можете зосередитися на розмові.",
        "12-мегапіксельна широка задня камера ідеально підходить для зйомки фотографій і відео 4K. А завдяки потужному ISP iPad тепер підтримує Smart HDR, тож ваші фотографії виглядають ще красивіше."
      ]
    }
  ]
}
